<?php
return [
    'groups' => [
        'user' => 'Пользователи',
        'movie' => 'Фильмы',
        'role' => 'роли',
        'task'=> 'Задачи'
    ],

    // Пользователи
    'user.view' => 'Просмотр пользователей',
    'user.create' => 'Создание пользователей',
    'user.edit' => 'Редактирование пользователей',
    'user.delete' => 'Удаление пользователей',
    'user.ban' => 'Блокировка пользователей',

    // Роли
    'role.view' => 'Просмотр ролей',
    'role.create' => 'Создание ролей',
    'role.edit' => 'Редактирование ролей',
    'role.delete' => 'Удаление ролей',
    'role.assign_permissions' => 'Назначение прав ролям',

    // Задачи
    'task.view' => 'Просмотр задач',
    'task.create' => 'Создание задач',
    'task.edit' => 'Редактирование задач',
    'task.delete' => 'Удаление задач',
    'task.assign' => 'Назначение задач',
    'task.complete' => 'Завершение задач',

    // Фильмы
    'movie.view' => 'Просмотр фильмов',
    'movie.create' => 'Добавление фильмов',
    'movie.edit' => 'Редактирование фильмов',
    'movie.delete' => 'Удаление фильмов',
    'movie.publish' => 'Публикация фильмов',
];
